In [ ]:
Json1 = [{'name': 'JOHN', 'age': 27}, {'name': 'HENRY2', 'age': 14}]

Json2 = { 1:{'name': 'vikash', 'age': 27}, 2:{'name': 'Satyam', 'age': 14} }

data = [{'id': 1, 'name': "Cole Volk", 'fitness': {'height': 130, 'weight': 60}}, {'name': "Mose Reg", 'fitness': {'height': 130, 'weight': 60}}, {'id': 2, 'name': 'Faye Raker', 'fitness': {'height': 130, 'weight': 60}}]

In [22]:
df1 = pd.DataFrame(Json1)

In [23]:
df1

     name  age
0    JOHN   27
1  HENRY2   14

In [24]:
df2 = pd.DataFrame(Json2).T

In [25]:
df2

     name age
1  vikash  27
2  Satyam  14

In [29]:
df3 = pd.concat([df1, df2], sort=True)
df3

  age    name
0  27    JOHN
1  14  HENRY2
1  27  vikash
2  14  Satyam

In [26]:
data = [{'id': 1, 
         'name': "Cole Volk", 
         'fitness': {'height': 130, 'weight': 60}}, 
        {'name': "Mose Reg",
         'fitness': {'height': 130, 'weight': 60}}, 
        {'id': 2, 
         'name': 'Faye Raker', 
         'fitness': {'height': 130, 'weight':60}}]
df = pd.DataFrame(data)

In [27]:
df

    id        name                        fitness
0  1.0   Cole Volk  {'height': 130, 'weight': 60}
1  NaN    Mose Reg  {'height': 130, 'weight': 60}
2  2.0  Faye Raker  {'height': 130, 'weight': 60}

In [30]:
df4 = pd.DataFrame([i for i in df.fitness])
df4

   height  weight
0     130      60
1     130      60
2     130      60

In [31]:
df4 = pd.concat([df, df4], axis=1).drop('fitness', axis=1)
df4

    id        name  height  weight
0  1.0   Cole Volk     130      60
1  NaN    Mose Reg     130      60
2  2.0  Faye Raker     130      60

In [33]:
df3.merge(df4, on='name', how='outer')

   age        name   id  height  weight
0   27        JOHN  NaN     NaN     NaN
1   14      HENRY2  NaN     NaN     NaN
2   27      vikash  NaN     NaN     NaN
3   14      Satyam  NaN     NaN     NaN
4  NaN   Cole Volk  1.0   130.0    60.0
5  NaN    Mose Reg  NaN   130.0    60.0
6  NaN  Faye Raker  2.0   130.0    60.0